In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://datahub.io/machine-learning/bank-marketing/r/bank-marketing.csv')

In [3]:
df.head()

,V1,V2,V3,V4,V5,V6,V7,V8,V9,V10,V11,V12,V13,V14,V15,V16,Class
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,1
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,1
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,1
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,1
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,1

In [4]:
df[['V5', 'V7', 'V8']] = df[['V5', 'V7', 'V8']].applymap(lambda x: True if x=='yes' else False)

In [5]:
df.dtypes

V1        int64
V2       object
V3       object
V4       object
V5         bool
V6        int64
V7         bool
V8         bool
V9       object
V10       int64
V11      object
V12       int64
V13       int64
V14       int64
V15       int64
V16      object
Class     int64
dtype: object

In [6]:
from TypeExtractor import TypeExtractor

In [15]:
selected = TypeExtractor(['object', 'timedelta'], True).fit_transform(df)

In [16]:
selected

                 V2        V3         V4         V9  V11      V16
0        management   married   tertiary    unknown  may  unknown
1        technician    single  secondary    unknown  may  unknown
2      entrepreneur   married  secondary    unknown  may  unknown
3       blue-collar   married    unknown    unknown  may  unknown
4           unknown    single    unknown    unknown  may  unknown
...             ...       ...        ...        ...  ...      ...
45206    technician   married   tertiary   cellular  nov  unknown
45207       retired  divorced    primary   cellular  nov  unknown
45208       retired   married  secondary   cellular  nov  success
45209   blue-collar   married  secondary  telephone  nov  unknown
45210  entrepreneur   married  secondary   cellular  nov    other

[45211 rows x 6 columns]